adviceArithmeticGeometry.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Advice for  graduate students in Arithmetic Geometry (Last updated May 2020)</title>
<!-- 2025-02-17 Mon 14:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Advice for  graduate students in Arithmetic Geometry (Last updated May 2020)</h1>
<p>
Below is a collection of advice that I have written to various Emory and Wisconsin graduate students.
</p>



<p>
(Note: I have recently moved from Emory to Amherst College, and my current institution does not have a phd program, so I am no longer accepting phd students.)
</p>

<p>
A summary of the advice is the following: learn Algebraic Geometry and Algebraic Number Theory early and repeatedly, read Silverman's AEC I, and half of AEC II, and read the two sets of notes by Poonen (<a href="http://www-math.mit.edu/~poonen/papers/Qpoints.pdf">Qpoints</a> and <a href="http://math.mit.edu/~poonen/papers/curves.pdf">Curves</a>). Qing Lui's book and Ravi Vakil's notes are great, either as an alternative to Hartshorne's book or as a supplement. Read other topics too (with suggestions below).  
</p>

<p>
Also, it is worth reading Poonen's advice on mathematical <a href="http://www-math.mit.edu/~poonen/papers/writing.pdf">writing</a> and <a href="http://www-math.mit.edu/~poonen/papers/speaking.pdf">speaking</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Main Advice</h2>
<div class="outline-text-2" id="text-1">
<p>
Your main first priority is to learn algebraic geometry very well and the core material from algebraic number theory. Second is to begin learning more advanced material. (Zeroth is to pass your qualifying exams.) Below is my advice for what someone in NT or algebra (but not analytic number theory) needs to know from algebraic geometry.
</p>

<p>
My own students: after this I will give you a starter project (something that I have a good idea of how to do but haven't actually tried to do), with the expectation that you will solve it and submit it for publication within a year. As this project nears its end, I will suggest other things for you to read to get a sense of what you are interested in, and will help you form a long term research plan and find other projects to work on.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Algebraic geometry.</h2>
<div class="outline-text-2" id="text-2">
<p>
The following is the core material, which typically takes a strong student a (calendar) year to learn well. I personally have needed to carefully learn the rest of Hartshorne for various projects, but the following is a good first pass.
</p>


<p>
Hart II.1-8, III.1-5,9, and IV.1-3. (Also, know the statement of Serre duality from III.6.)
</p>

<p>
This is easily a (calendar) year's work of material to learn. Also, its pretty difficult to learn this by just reading Hartshorne. (I had a large department's worth of people to ask questions to, and read lots of other sources too, e.g., "The geometry of schemes" and Eisenbud's commutative algebra book, as well as William Stein's latex'd notes from Hartshorne's 2000 algebraic geometry course.)
</p>

<p>
There of course is a small bit of healthy disagreement. If I were writing the syllabus for an AG qual, the above would be it. Suresh Venapally suggested a slightly shorter version (Hart II.1-6, III.1-5, and IV.1-2), but with more commutative algebra. 
</p>

<p>
Its also good to know a little bit of chapter 5 (e.g. V.1-2, so being familiar with the intersection pairing on a surface, what a blow up is, and the story of the 27 lines on a cubic surface). 
</p>

<p>
You should of course solicit other opinions. But to support my opinion, 10/13 of Parimala's papers on the arxiv have the word "scheme" in them. (I didn't search the other 3 for "variety" or other geometric terms).
</p>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Algebraic Number Theory.</h2>
<div class="outline-text-2" id="text-3">
<p>
I consider the first 2 1/2 chapters of Neukirch to contain most of the core material. Neukirch has great exposition, but not too many problems, so I would supplement this with problems from Marcus's Number Fields book (this one has many more problems, especially computational ones). Keith Conrad has quite a few good notes. See also <a href="http://mathoverflow.net/questions/13282/good-algebraic-number-theory-books">this</a> MO question.
</p>

<p>
Its also important to know the statements of class field theory and how to apply them in various situations. (The proofs, while beautiful, aren't what I'd consider core background.) On the other hand, you do need to know Galois cohomology, adeles, statements of proofs, etc.
</p>


<p>
#** MO posts to read (I haven't curated much from this yet.)
</p>

<p>
#*** <a href="http://math.stackexchange.com/questions/27122/why-is-the-coordinate-ring-of-a-projective-variety-not-determined-by-the-isomorp">http://math.stackexchange.com/questions/27122/why-is-the-coordinate-ring-of-a-projective-variety-not-determined-by-the-isomorp</a>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Emory's qualifying exams</h2>
<div class="outline-text-2" id="text-4">
<p>
You must take the algebra and analysis exams, and one more. (If you can, take these immediately upon arrival at Emory.) If you are hoping to work in algebra, I recommend taking the algebraic geometry exam. There will not always be a course in algebraic geometry; if not, take a year long reading course. 
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">After this.</h2>
<div class="outline-text-2" id="text-5">
<p>
Below is an email I sent early on to a Wisconsin graduate student, on what to do to complement learning algebraic geometry.
</p>

<p>
Here is my running list of advice, which, for now, is geared more for someone who has already been through Hartshorne and Silverman I.
</p>

<ol class="org-ol">
<li>I would pick something easy, like Silverman II or one of Serre's old papers (GAGA, FAC)
</li>
<li>and also pick something hard (e.g., Mazur's Eisenstein paper, or the proof of one of the `big three') to read.
</li>
</ol>

<p>
Also see Emerton's advice: <a href="http://terrytao.wordpress.com/career-advice/learn-and-relearn-your-field/#comment-36823/">http://terrytao.wordpress.com/career-advice/learn-and-relearn-your-field/#comment-36823/</a> 
and info for students <a href="http://www.math.uchicago.edu/~emerton/research.html#students">http://www.math.uchicago.edu/~emerton/research.html#students</a>
</p>

<p>
Here are some more detailed suggestions.
</p>

<p>
A proof of any of the big three is worthwhile to learn:
</p>
<ul class="org-ul">
<li>Proof of FLT
</li>
<li>Proof of Faltings theorem
</li>
<li>Proof of Weil conjectures
</li>
</ul>

<p>
(It is important with these to find a nice balance between learning background and technical details and plowing forward to get a big picture of what is going on and how things fit together. Each of these have lots of `moving parts', and its good to first get a sense of what those parts are before learning each part in isolation. So for instance, it is easy to fall into the trap of spending 6 months just reading about the basics of etale cohomology, without ever reading about any interesting application of it or understanding an overview of the Weil conjectures. OTOH, you should spend <b>some</b> time doing basic exercises about etale morphisms and sites and such.)
</p>

<p>
Silverman II contains a nice survey of topics, and is lighter reading than the above. Learn about 
</p>
<ul class="org-ul">
<li>Neron models and minimal models of curves, 
</li>
<li>CFT of imaginary quadratic etc. 
</li>
<li>Tate curve
</li>
<li>There's more stuff too (e.g., modular forms) that I haven't read as carefully.
</li>
</ul>

<p>
Papers 
</p>
<ul class="org-ul">
<li>Serre's GAGA and FAC are classics and will really solidify your knowledge.
</li>
<li>Mazur's modular curves papers (Eisenstein ideal, etc). One of Jordan's <a href="http://quomodocumque.wordpress.com/2009/07/24/le-groupe-fondamental-de-la-droite-projective-moins-trois-points-is-now-online/">three favorite papers</a>. 
</li>
<li>Another of his favorites is the article mentioned by Deligne in that link. 
</li>
<li>Serre-Tate.
</li>
</ul>

<p>
More generally, see Emerton's advice:
</p>

<ul class="org-ul">
<li><a href="http://math.uchicago.edu/~emerton/research.html#students">http://math.uchicago.edu/~emerton/research.html#students</a>
</li>
<li><a href="http://mathoverflow.net/questions/3041/the-importance-of-ega-and-sga-for-students-of-today/14550#14550">http://mathoverflow.net/questions/3041/the-importance-of-ega-and-sga-for-students-of-today/14550#14550</a> (see the Emerton's comment too)
</li>
<li><a href="http://terrytao.wordpress.com/career-advice/learn-and-relearn-your-field/#comment-36823/">http://terrytao.wordpress.com/career-advice/learn-and-relearn-your-field/#comment-36823/</a> (this comment by Emerton was something we thought and talked a lot about as motivation for mathoverflow)
</li>
</ul>

<p>
If you're looking for more geometric things with less NT content 
</p>
<ul class="org-ul">
<li>Beauville's book "Complex Algebraic Surfaces"
</li>
<li>Harris and Morrison (this is worth spending a lot of time on)  
</li>
<li>Deligne and Mumford's Irreducibility of the Moduli space of curves paper
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Other advice</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Go to the algebra seminar every week, no matter what. It will be difficult to understand things at first, but write down things you don't understand and ask me about them later. See also  Ravi's <a href="http://math.stanford.edu/~vakil/threethings.html">Three things</a>.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Collection of advice pages</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="http://www-math.mit.edu/~poonen/advice.html">Bjorn Poonen</a>
</li>
<li><a href="http://www-math.mit.edu/~kedlaya/notes_students.shtml">Kiran Kedlaya</a>
</li>
<li><a href="http://www.math.wisc.edu/~ellenber/gradstudents.html">Jordan Ellenberg</a>
</li>
<li>Ravi Vakil
<ul class="org-ul">
<li><a href="http://math.stanford.edu/~vakil/recommendations.html">Advice on recommendations</a>
</li>
<li><a href="http://math.stanford.edu/~vakil/threethings.html">Three things exercise</a>
</li>
</ul>
</li>
<li><a href="http://terrytao.wordpress.com/career-advice/">Terry Tao</a>
</li>
<li><a href="http://www.math.uchicago.edu/~emerton/research.html#students">Matt Emerton</a>
</li>
<li><a href="http://math.berkeley.edu/~allenk/advising.html">Allen Knutson's old advice page</a>
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Collection of pages with substantial expository content</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="http://swc.math.arizona.edu/">Arizona Winter School</a>, especially <a href="http://swc.math.arizona.edu/notes/index.html">here</a>
</li>
<li><a href="http://www.math.uconn.edu/~kconrad/">Keith Conrad</a>, especially <a href="http://www.math.uconn.edu/~kconrad/blurbs/">here</a>
</li>
<li><a href="http://www.math.uchicago.edu/~emerton/">Matt Emerton</a>, especially <a href="http://www.math.uchicago.edu/~emerton/">here</a>
</li>
<li><a href="http://www.math.harvard.edu/~mazur/">Barry Mazur</a> (several articles throught)
</li>
<li><a href="http://www-math.mit.edu/~mckernan/">James Mckernan</a>, especially <a href="http://math.mit.edu/~mckernan/Teaching/teaching.html">here</a>
</li>
<li><a href="http://math.bu.edu/people/potthars/">Jay Pottharst</a>, especially <a href="http://math.bu.edu/people/potthars/writings/">here</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">A few lengthy notes on my experience learning certain topics. (Your mileage may vary.)</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>My experience <a href="http://www.math.emory.edu/~dzb/adviceSchemeTheory.html">learning scheme theory</a>
</li>
<li>My experience <a href="http://www.math.emory.edu/~dzb/adviceStacks.html">learning stacks</a>
</li>
<li>My experience <a href="http://www.math.emory.edu/~dzb/adviceFLT.html">learning Fermat's Last Theorem</a>
</li>
<li>My experience <a href="http://www.math.emory.edu/~dzb/adviceMazursTheorem.html">learning Mazur's Torsion and Isogeny theorems</a>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>